app/controllers/users_controller.rb

SELECT "betting_pools".* FROM "betting_pools" WHERE "betting_pools"."user_id" = 1 LIMIT 1
---
  def index
    if @current_user != nil && @betting_pool != nil then
      @betting_pool = BettingPool.find(session[:last_betting_pool_id])

SELECT "users".* FROM "users" WHERE "users"."email" = 'dejavite@stanford.edu' LIMIT 1
SELECT "betting_pools".* FROM "betting_pools" WHERE "betting_pools"."user_id" = 1 LIMIT 1
---
  def post_login

    @user = User.find_by_email(params[:login])

    if @user != nil && @user.password_valid?(params[:password]) then
    	session[:user_id] = @user.id
      @betting_pool = BettingPool.find_by(:user_id => @user.id)

SELECT "users".* FROM "users" WHERE "users"."email" = 'dejavite@stanford.edu' LIMIT 1
SELECT 1 AS one FROM "users" WHERE "users"."email" = 'abc@abc.com.br' LIMIT 1
UPDATE "users" SET "name" = $1, "salt" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = 1
---
  def create

    if User.exists?(:email => params[:user][:email]) then

      @user = User.find_by_email(params[:user][:email])

      if @user.password_digest == nil then
        @user.name = params[:user][:name]
        @user.password = params[:user][:password]

        if params[:user][:password] != params[:password_copy] then
          @user.errors.add(:password, " don't match!")
        end

        if params[:user][:password] == params[:password_copy] && @user.save